class PrivacyPolicyRU {
  static const String data = """
  <p style="text-align:center"><b>Политика конфиденциальности в области обработки и обеспечения безопасности персональных данных</b></p>
<p>Настоящая Политика конфиденциальности персональных данных (далее - Политика конфиденциальности) действует в отношении всей информации, размещенной на сайте в сети Интернет по адресу: http://wokkalokka.com, http://web.wokkalokka.com (далее - Сайт), а также в мобильном/веб приложении Wokka Lokka (далее - Приложение), которую посетители, другие пользователи, иные лица могут получить о Пользователе во время использования Сайта и/или Приложения, их сервисов, программ и продуктов.</p>
<p>Администратором Сайта/Приложения является общество с ограниченной ответственностью «ВоккаЛокка» (ИНН 4205331875, ОГРН 1164205071436, адрес: 650000, г. Кемерово, ул. Карболитовская, 20, пом.1) (далее - Администратор).</p>
<p>Использование сервисов Сайта/Приложения означает безоговорочное согласие Пользователя с настоящей Политикой и указанными в ней условиями обработки его персональной информации; в случае несогласия с этими условиями Пользователь должен воздержаться от использования сервисов.</p>
<p style="text-align:center"><b>1. ОБЩИЕ ПОЛОЖЕНИЯ</b></p>
<p>1.1. В рамках настоящей Политики под персональной информацией Пользователя понимаются:</p>
<p>1.1.1. Персональная информация, которую Пользователь предоставляет о себе самостоятельно при регистрации (создании учетной записи) на Сайте/ в Приложении или в процессе использования их Сервисов, а также персональные данные Пользователя, в том числе, но не ограничиваясь номер мобильного телефона и электронную почту.</p>
<p>1.1.2. Данные, которые автоматически передаются сервисам Сайта в процессе их использования с помощью установленного на устройстве Пользователя программного обеспечения, в том числе IP-адрес, данные файлов cookie, информация о браузере Пользователя (или иной программе, с помощью которой осуществляется доступ к сервисам), технические характеристики оборудования и программного обеспечения, используемых Пользователем и т.д..</p>
<p>1.1.4. Настоящая Политика конфиденциальности применяется к сайтам http://wokkalokka.com, http://web.wokkalokka.com, к мобильному и веб приложению Wokka Lokka, а также к иным сайтам/приложениям Администратора, которые ссылаются на данную Политику. Сайт и Приложение не контролирует и не несет ответственности за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на Сайте и в Приложении.</p>
<p style="text-align:center"><b>2. ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ</b></p>
<p>2.1. Сайт/Приложение собирает и хранит только ту персональную информацию, которая необходима для предоставления его сервисов или исполнения конкретного соглашения с Пользователем, за исключением случаев, когда законодательством предусмотрено обязательное хранение персональной информации в течение определенного законом срока.</p>
<p>2.2. Персональную информацию Пользователя Сайт/Приложение обрабатывает в следующих целях:</p>
<p>2.2.1. Идентификации Пользователя, зарегистрированного на Сайте/ в Приложении.</p>
<p>2.2.2. Предоставления Пользователю доступа к персонализированным ресурсам Сайта/Приложения.</p>
<p>2.2.3. Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования Сайта/Приложения, оказания услуг, обработку запросов и заявок от Пользователя.</p>
<p>2.2.4. Определения места нахождения Пользователя для обеспечения безопасности, предотвращения мошенничества.</p>
<p>2.2.5. Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.</p>
<p>2.2.6. Создания учетной записи Пользователя.</p>
<p>2.2.7. Уведомления Пользователя Сайта/Приложения о действующих у Администратора акциях, специальных предложениях, направление Пользователю любых иных информационных сообщений, включая рекламу.</p>
<p>2.2.8. Предоставления Пользователю эффективной клиентской и технической поддержки при возникновении проблем, связанных с использованием Сайта/Приложения.</p>
<p>2.2.9. Проведения статистических и иных исследований, проведение опросов.</p>
<p style="text-align:center"><b>3. УСЛОВИЯ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ И ЕЕ ПЕРЕДАЧИ ТРЕТЬИМ ЛИЦАМ</b></p>
<p>3.1. При организации и осуществлении обработки персональных данных Администратор руководствуется требованиями Федерального закона от 27.07.2006 года № 152-ФЗ «О персональных данных» и принятыми в соответствии с ним нормативно правовыми актами, и локальными актами Администратора.</p>
<p>3.2. В отношении персональной информации Пользователя сохраняется ее конфиденциальность, кроме случаев добровольного предоставления Пользователем информации о себе для общего доступа неограниченному кругу лиц. При использовании отдельных сервисов Пользователь соглашается с тем, что определенная часть его персональной информации становится общедоступной.</p>
<p>3.3. Администратор вправе передать персональную информацию Пользователя третьим лицам в следующих случаях:</p>
<p>3.3.1. Пользователь выразил согласие на такие действия.</p>
<p>3.3.2. Передача необходима для использования Пользователем определенного сервиса Сайта/Приложения либо для исполнения конкретного соглашения или договора с Пользователем.</p>
<p>3.3.4. Передача предусмотрена российским или иным применимым законодательством в рамках установленной законодательством процедуры.</p>
<p>3.3.5. В случае продажи Сайта/Приложения к приобретателю переходят все обязательства по соблюдению условий настоящей Политики применительно к полученной им персональной информации.</p>
<p>3.4. Обработка персональных данных Пользователя осуществляется без ограничения срока любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств.</p>
<p>3.5. При утрате или разглашении персональных данных Администратор Сайта/Приложения информирует Пользователя об утрате или разглашении персональных данных.</p>
<p>3.6. Администратор Сайта/Приложения принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц.</p>
<p>3.7. Администратор Сайта/Приложения совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.</p>
<p style="text-align:center"><b>4. ОБЯЗАТЕЛЬСТВА СТОРОН</b></p>
<p>4.1. Пользователь обязан:</p>
<p>4.1.1. Предоставить информацию о персональных данных, необходимую для пользования Сайтом/Приложением.</p>
<p>4.1.2. Обновлять, дополнять предоставленную информацию о персональных данных в случае изменения данной информации.</p>
<p>4.2. Администратор обязан:</p>
<p>4.2.1. Использовать полученную информацию исключительно для целей, указанных в настоящей Политике конфиденциальности.</p>
<p>4.2.2. Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением предусмотренных настоящей Политикой конфиденциальности.</p>
<p>4.2.3. Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку, обычно используемому для защиты такого рода информации в существующем деловом обороте.</p>
<p>4.2.4. Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки в случае выявления недостоверных персональных данных или неправомерных действий.</p>
<p>4.2.5. Прекратить обработку персональных данных в случае получения отзыва согласия на обработку персональных данных, полученного по электронной почте info@wokkalokka.ru.</p>
<p style="text-align:center"><b>5. ОТВЕТСТВЕННОСТЬ СТОРОН</b></p>
<p>5.1. Администратор, не исполнивший свои обязательства, несет ответственность за убытки, понесенные Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Российской Федерации.</p>
<p>5.2. В случае утраты или разглашения конфиденциальной информации Администратор не несет ответственности, если данная конфиденциальная информация:</p>
<p>5.2.1. Стала публичным достоянием до ее утраты или разглашения.</p>
<p>5.2.2. Была получена от третьей стороны до момента ее получения Администратором.</p>
<p>5.2.3. Была разглашена с согласия Пользователя.</p>
<p style="text-align:center"><b>6. РАЗРЕШЕНИЕ СПОРОВ</b></p>
<p>6.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем Сайта/Приложения и Администратором, обязательным является предъявление претензии (письменного предложения о добровольном урегулировании спора).</p>
<p>6.2. Получатель претензии в течение 10 календарных дней со дня получения претензии письменно уведомляет заявителя претензии о результатах рассмотрения претензии.</p>
<p>6.3. При недостижении согласия спор передается на рассмотрение в суд в соответствии с территориальной подсудностью по месту нахождения Администратора (г. Кемерово).</p>
<p>6.4. К настоящей Политике конфиденциальности и отношениям между Пользователем и Администратором применяется действующее законодательство Российской Федерации.</p>
<p style="text-align:center"><b>7. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</b></p>
<p>7.1. Администратор вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.</p>
<p>7.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения на Сайте/ в Приложении, если иное не предусмотрено новой редакцией Политики конфиденциальности.</p>
<p>7.3. Все предложения или вопросы по настоящей Политике конфиденциальности следует сообщать на эл. почту: info@wokkalokka.ru.</p>
<p>7.4. Действующая Политика конфиденциальности размещена на странице по адресу: http://wokkalokka.com, http://web.wokkalokka.com, а также на экране авторизации Приложения.</p>
  """;
}